### EJERCICIO 1.- Importación y exploración inicial

##### Crea un nuevo cuaderno de Python y realiza los siguientes pasos:

In [1]:
#1. Importa la librería pandas con el alias habitual.
import pandas as pd

In [13]:
#2. Comprueba la versión instalada mediante pd.__version__.
pd.__version__

'2.2.3'

#### 3. Muestra todas las funciones disponibles escribiendo pd. y usando el autocompletado (explica brevemente lo que observas).

##### Salen estos valores:

##### pd.DataFrame: Estructura en dos dimensiones(tablas), se construyen a partir de arrays
##### pd.Series: Estructura en una dimensión, se construyen a partir de arrays

#####

#### 4. Añade un comentario en tu cuaderno explicando para qué sirve Pandas dentro del análisis de datos, según lo leído en tus apuntes.
##### Facilita desde la lectura de ficheros hasta la preparación de datos de modelos Machine Learning

#####

### Ejercicio 2. Crear tu primera Serie

In [36]:
#1. Crea una Serie con los nombres de cinco asignaturas de un curso.
asignaturas=["OPT","DES","DEC","DPA","DIW"]
print(asignaturas)

['OPT', 'DES', 'DEC', 'DPA', 'DIW']

In [37]:
#2. Crea otra Serie con las notas numéricas correspondientes (de 0 a 10).
notas=[10,5,6,8,7]
print(notas)

[10, 5, 6, 8, 7]

In [43]:
#3. Asigna los nombres de las asignaturas como índice de la Serie de notas.
serie = pd.Series(notas,index=asignaturas)

In [44]:
#4. Muestra por pantalla: 
#    o Los valores de la Serie. 
#    o El índice. 
#    o El tipo de datos (dtype).
#    o El número de elementos (size).
print(serie)
print(serie.size)

OPT    10
DES     5
DEC     6
DPA     8
DIW     7
dtype: int64
5

In [ ]:
#5. Escribe una breve observación sobre la diferencia entre índices y valores.
#indice es una posición del dato (ejemplo:1) y el valor es el contenido del indice(ejemplo:"patata")

### Ejercicio 3. Series con diccionarios

In [8]:
#1. Crea un diccionario en Python donde las claves sean los nombres de estudiantes y los valores sus calificaciones.
calificaciones = {
    "David": 9.2,
    "Noelia": 8.5,
    "Marta": 9.8,
    "Leonardo": 7.9,
    "Elena": 10.0
}

In [9]:
#2. Convierte el diccionario en una Serie de pandas.
serie=pd.Series(calificaciones)

In [11]:
#3. Muestra por pantalla: 
#    o La Serie completa. 
#    o El valor asociado a un estudiante concreto usando su nombre como índice.
print(serie)
print(serie["David"])

David        9.2
Noelia       8.5
Marta        9.8
Leonardo     7.9
Elena       10.0
dtype: float64
9.2

In [3]:
#4. Añade un comentario sobre la ventaja de usar un diccionario frente a una lista al crear una Serie.
#El diccionario son mas descriptivos y faciles de acceder que una serie ya que tienen una clave para acceder

### Ejercicio 4. Crear tu primer DataFrame

In [13]:
#1. Crea un diccionario con los siguientes datos (cada clave será una columna): 
#    o nombre → cuatro nombres de personas. 
#    o edad → sus edades. 
#    o correo → sus direcciones de correo.

personas={
    "nombre":["Juan",
              "Benito",
              "Pedro",
              "Miguel"],
    "edad":[18,
            25,
            17,
            21],
    "correo":[
        "juan@juan.com",
        "benito@benito.com",
        "pedro@pedro.com",
        "miguel@miguel.com"
    ]
}

In [15]:
#2. Convierte el diccionario en un DataFrame y asígnalo a una variable df.
df = pd.DataFrame(personas)

In [16]:
#3. Muestra la tabla completa.
print(df)

   nombre  edad             correo
0    Juan    18      juan@juan.com
1  Benito    25  benito@benito.com
2   Pedro    17    pedro@pedro.com
3  Miguel    21  miguel@miguel.com

In [20]:
#4. Utiliza los métodos: 
#    o df.info() para obtener la información general.
print("Información general")
df.info()
print("")
#    o df.shape para ver el tamaño.
print("Tamaño")
print(df.shape)
print("")
#    o df.dtypes para ver los tipos de datos.
print("Tipo de dato")
print(df.dtypes)

Información general
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nombre  4 non-null      object
 1   edad    4 non-null      int64
 2   correo  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

Tamaño
(4, 3)

Tipo de dato
nombre    object
edad       int64
correo    object
dtype: object

In [5]:
#5. Comenta brevemente qué diferencia hay entre una Serie y un DataFrame.
#Serie es unidimensional o columna y DataFrame es bidimensional o tabla

### Ejercicio 5. Acceso y primeras transformaciones

In [21]:
#1. A partir del DataFrame anterior: 
#    o Muestra la primera fila con df.head(1).
print(df.head(1))
print("")
#    o Selecciona solo la columna nombre.
print(df["nombre"])
print("")
#    o Añade una nueva columna llamada curso con el valor "DAW2" para todos los registros.
df["curso"] = "DAW2"
print("")
#    o Cambia el nombre de la columna correo por email.
df.rename(columns={"correo": "email"}, inplace=True)

  nombre  edad         correo
0   Juan    18  juan@juan.com

0      Juan
1    Benito
2     Pedro
3    Miguel
Name: nombre, dtype: object

In [22]:
#2. Muestra el resultado final.
print(df)

   nombre  edad              email curso
0    Juan    18      juan@juan.com  DAW2
1  Benito    25  benito@benito.com  DAW2
2   Pedro    17    pedro@pedro.com  DAW2
3  Miguel    21  miguel@miguel.com  DAW2

In [ ]:
#3. Escribe un comentario explicando por qué los DataFrames son estructuras adecuadas para trabajar con datos tabulares en análisis de datos.
#Facilitan la lectura de algunos tipos de archivos como .csv o .xlsx
#Tambíen se puede utilizar algunas herramientas para filtrar,ordenar,agrupar,etc

### Ejercicio 6 – Análisis inicial de un conjunto de datos

In [57]:
#1. Carga el archivo ventas.csv con read_csv().
df = pd.read_csv("ventas.csv")

In [58]:
#2. Muestra: 
#    o El número de filas y columnas (shape).
print(df.shape)
print("")
#    o Los nombres de las columnas (columns).
print(df.columns)
print("")
#    o Las 5 primeras filas (head()).
print(df.head())
print("")

(30, 9)

Index(['id', 'fecha', 'producto', 'categoria', 'unidades', 'precio_unitario',
       'importe', 'tienda', 'vendedor'],
      dtype='object')

   id       fecha         producto    categoria  unidades  precio_unitario  \
0   1  2024-01-02      Portátil HP  Informática         1            799.0
1   2  2024-01-02   Ratón Logitech   Accesorios         3             25.0
2   3  2024-01-03  Monitor Samsung       Imagen         2            210.0
3   4  2024-01-03  Impresora Epson      Oficina         1            140.0
4   5  2024-01-04    Altavoces JBL       Sonido         2             90.0

   importe   tienda vendedor
0    799.0  Sevilla      Ana
1     75.0    Cádiz     Luis
2    420.0  Sevilla      Ana
3    140.0   Málaga   Carmen
4    180.0    Cádiz     Luis

In [59]:
#3. Calcula la media, máximo, mínimo y desviación típica de la columna importe.
media = df["importe"].mean()
maximo = df["importe"].max()
minimo = df["importe"].min()
desviacion = df["importe"].std()

print("media: ",media)
print("maximo: ",maximo)
print("minimo: ",minimo)
print("desviacion: ",desviacion)

media:  274.0
maximo:  799.0
minimo:  45.0
desviacion:  224.83373166976463

In [60]:
#4. Añade una columna llamada IVA con el 21 % del importe de cada venta.
df["IVA"] = df["importe"] * 0.21
print(df)

    id       fecha            producto       categoria  unidades  \
0    1  2024-01-02         Portátil HP     Informática         1
1    2  2024-01-02      Ratón Logitech      Accesorios         3
2    3  2024-01-03     Monitor Samsung          Imagen         2
3    4  2024-01-03     Impresora Epson         Oficina         1
4    5  2024-01-04       Altavoces JBL          Sonido         2
5    6  2024-01-05          Teclado HP      Accesorios         4
6    7  2024-01-06      Router TP-Link           Redes         1
7    8  2024-01-06       Tablet Lenovo     Informática         1
8    9  2024-01-07      Disco Duro 1TB  Almacenamiento         2
9   10  2024-01-07            USB 64GB      Accesorios         5
10  11  2024-01-08        Cámara Canon          Imagen         1
11  12  2024-01-08  Altavoces Logitech          Sonido         1
12  13  2024-01-09          Monitor LG          Imagen         3
13  14  2024-01-09        Impresora HP         Oficina         2
14  15  2024-01-10       Portátil Asus     Informática         1
15  16  2024-01-10      Tablet Samsung     Informática         2
16  17  2024-01-11     Disco SSD 512GB  Almacenamiento         2
17  18  2024-01-11         Router ASUS           Redes         1
18  19  2024-01-12    Teclado mecánico      Accesorios         2
19  20  2024-01-12   Smartwatch Garmin       Wearables         1
20  21  2024-01-13      Altavoces Bose          Sonido         1
21  22  2024-01-13     Monitor Philips          Imagen         1
22  23  2024-01-14       Tablet Huawei     Informática         1
23  24  2024-01-14   Impresora Brother         Oficina         1
24  25  2024-01-15        Ratón Genius      Accesorios         4
25  26  2024-01-15       Portátil Acer     Informática         1
26  27  2024-01-16         Cámara Sony          Imagen         1
27  28  2024-01-16           USB 128GB      Accesorios         3
28  29  2024-01-17      Altavoces Sony          Sonido         2
29  30  2024-01-17      Router TP-Link           Redes         2

    precio_unitario  importe   tienda vendedor     IVA
0             799.0    799.0  Sevilla      Ana  167.79
1              25.0     75.0    Cádiz     Luis   15.75
2             210.0    420.0  Sevilla      Ana   88.20
3             140.0    140.0   Málaga   Carmen   29.40
4              90.0    180.0    Cádiz     Luis   37.80
5              35.0    140.0  Granada     Raúl   29.40
6              65.0     65.0  Sevilla      Ana   13.65
7             270.0    270.0   Málaga   Carmen   56.70
8              60.0    120.0  Granada     Raúl   25.20
9              10.0     50.0    Cádiz     Luis   10.50
10            480.0    480.0  Sevilla      Ana  100.80
11             85.0     85.0  Granada     Raúl   17.85
12            190.0    570.0  Sevilla      Ana  119.70
13            130.0    260.0  Córdoba    Laura   54.60
14            750.0    750.0  Granada     Raúl  157.50
15            310.0    620.0    Cádiz     Luis  130.20
16             85.0    170.0  Sevilla      Ana   35.70
17            120.0    120.0   Málaga   Carmen   25.20
18             55.0    110.0  Córdoba    Laura   23.10
19            190.0    190.0  Granada     Raúl   39.90
20            230.0    230.0  Sevilla      Ana   48.30
21            175.0    175.0    Cádiz     Luis   36.75
22            295.0    295.0   Málaga   Carmen   61.95
23            150.0    150.0  Córdoba    Laura   31.50
24             18.0     72.0  Granada     Raúl   15.12
25            699.0    699.0    Cádiz     Luis  146.79
26            520.0    520.0  Sevilla      Ana  109.20
27             15.0     45.0  Granada     Raúl    9.45
28            150.0    300.0  Córdoba    Laura   63.00
29             60.0    120.0    Cádiz     Luis   25.20

In [61]:
#5. Muestra el resultado y guarda el nuevo DataFrame como ventas_modificado.csv.
df.to_csv("ventas_modificado.csv")
df=pd.read_csv("ventas_modificado.csv")
print(df)

    Unnamed: 0  id       fecha            producto       categoria  unidades  \
0            0   1  2024-01-02         Portátil HP     Informática         1
1            1   2  2024-01-02      Ratón Logitech      Accesorios         3
2            2   3  2024-01-03     Monitor Samsung          Imagen         2
3            3   4  2024-01-03     Impresora Epson         Oficina         1
4            4   5  2024-01-04       Altavoces JBL          Sonido         2
5            5   6  2024-01-05          Teclado HP      Accesorios         4
6            6   7  2024-01-06      Router TP-Link           Redes         1
7            7   8  2024-01-06       Tablet Lenovo     Informática         1
8            8   9  2024-01-07      Disco Duro 1TB  Almacenamiento         2
9            9  10  2024-01-07            USB 64GB      Accesorios         5
10          10  11  2024-01-08        Cámara Canon          Imagen         1
11          11  12  2024-01-08  Altavoces Logitech          Sonido         1
12          12  13  2024-01-09          Monitor LG          Imagen         3
13          13  14  2024-01-09        Impresora HP         Oficina         2
14          14  15  2024-01-10       Portátil Asus     Informática         1
15          15  16  2024-01-10      Tablet Samsung     Informática         2
16          16  17  2024-01-11     Disco SSD 512GB  Almacenamiento         2
17          17  18  2024-01-11         Router ASUS           Redes         1
18          18  19  2024-01-12    Teclado mecánico      Accesorios         2
19          19  20  2024-01-12   Smartwatch Garmin       Wearables         1
20          20  21  2024-01-13      Altavoces Bose          Sonido         1
21          21  22  2024-01-13     Monitor Philips          Imagen         1
22          22  23  2024-01-14       Tablet Huawei     Informática         1
23          23  24  2024-01-14   Impresora Brother         Oficina         1
24          24  25  2024-01-15        Ratón Genius      Accesorios         4
25          25  26  2024-01-15       Portátil Acer     Informática         1
26          26  27  2024-01-16         Cámara Sony          Imagen         1
27          27  28  2024-01-16           USB 128GB      Accesorios         3
28          28  29  2024-01-17      Altavoces Sony          Sonido         2
29          29  30  2024-01-17      Router TP-Link           Redes         2

    precio_unitario  importe   tienda vendedor     IVA
0             799.0    799.0  Sevilla      Ana  167.79
1              25.0     75.0    Cádiz     Luis   15.75
2             210.0    420.0  Sevilla      Ana   88.20
3             140.0    140.0   Málaga   Carmen   29.40
4              90.0    180.0    Cádiz     Luis   37.80
5              35.0    140.0  Granada     Raúl   29.40
6              65.0     65.0  Sevilla      Ana   13.65
7             270.0    270.0   Málaga   Carmen   56.70
8              60.0    120.0  Granada     Raúl   25.20
9              10.0     50.0    Cádiz     Luis   10.50
10            480.0    480.0  Sevilla      Ana  100.80
11             85.0     85.0  Granada     Raúl   17.85
12            190.0    570.0  Sevilla      Ana  119.70
13            130.0    260.0  Córdoba    Laura   54.60
14            750.0    750.0  Granada     Raúl  157.50
15            310.0    620.0    Cádiz     Luis  130.20
16             85.0    170.0  Sevilla      Ana   35.70
17            120.0    120.0   Málaga   Carmen   25.20
18             55.0    110.0  Córdoba    Laura   23.10
19            190.0    190.0  Granada     Raúl   39.90
20            230.0    230.0  Sevilla      Ana   48.30
21            175.0    175.0    Cádiz     Luis   36.75
22            295.0    295.0   Málaga   Carmen   61.95
23            150.0    150.0  Córdoba    Laura   31.50
24             18.0     72.0  Granada     Raúl   15.12
25            699.0    699.0    Cádiz     Luis  146.79
26            520.0    520.0  Sevilla      Ana  109.20
27             15.0     45.0  Granada     Raúl    9.45
28            150.0    300.0  Córdoba    Laura   63.00
29             60.0    120.0    Cádiz     Luis   25.20

### Ejercicio 7 – Creación de columnas condicionales

In [80]:
#Se trabaja con el fichero democanarias.csv.
df = pd.read_csv("democanarias.csv")

In [81]:
#1. Carga el fichero y muestra las columnas disponibles.
print(df.columns)

Index(['Island', 'Population', 'Area', 'Province'], dtype='object')

In [49]:
#2. Añade una nueva columna Ayuda siguiendo estas condiciones: 
#    o Si Area < 1000 → Ayuda = 30 % de la Popula on. 
#    o En caso contrario → Ayuda = 20 % de la Popula on.
df["Ayuda"] = df.apply(lambda fila: fila["Population"] * 0.3 if fila["Area"] < 1000 else fila["Population"] * 0.2,axis=1)
print(df)

          Island  Population     Area Province     Ayuda
0   Gran Canaria      855521  1560.10     LPGC  171104.2
1       Tenerife      928604  2034.38     SCTF  185720.8
2       La Palma       83458   708.32     SCTF   25037.4
3      Lanzarote      155812   845.94     LPGC   46743.6
4      La Gomera       21678   369.76     SCTF    6503.4
5      El Hierro       11147   278.71     SCTF    3344.1
6  Fuerteventura      119732  1659.00     LPGC   23946.4

In [50]:
#3. Convierte la nueva columna a tipo float64.
df["Ayuda"] = df["Ayuda"].astype("float64")
print(df.dtypes)

Island         object
Population      int64
Area          float64
Province       object
Ayuda         float64
dtype: object

In [51]:
#4. Sustituye la columna Island por un índice con los nombres de las islas.
df.set_index("Island", inplace=True)
print(df)

               Population     Area Province     Ayuda
Island
Gran Canaria       855521  1560.10     LPGC  171104.2
Tenerife           928604  2034.38     SCTF  185720.8
La Palma            83458   708.32     SCTF   25037.4
Lanzarote          155812   845.94     LPGC   46743.6
La Gomera           21678   369.76     SCTF    6503.4
El Hierro           11147   278.71     SCTF    3344.1
Fuerteventura      119732  1659.00     LPGC   23946.4

In [55]:
#5. Guarda el resultado en un nuevo CSV canarias_ayudas.csv.
df.to_csv("canarias_ayudas.csv")
df=pd.read_csv("canarias_ayudas.csv")
print(df)

   Unnamed: 0         Island  Population     Area Province     Ayuda
0           0   Gran Canaria      855521  1560.10     LPGC  171104.2
1           1       Tenerife      928604  2034.38     SCTF  185720.8
2           2       La Palma       83458   708.32     SCTF   25037.4
3           3      Lanzarote      155812   845.94     LPGC   46743.6
4           4      La Gomera       21678   369.76     SCTF    6503.4
5           5      El Hierro       11147   278.71     SCTF    3344.1
6           6  Fuerteventura      119732  1659.00     LPGC   23946.4

### Ejercicio 8 – Limpieza y análisis básico de un dataset

In [85]:
#Usando el archivo titanic.csv:
df=pd.read_csv("titanic.csv")

In [86]:
#1. Carga el archivo y muestra información general (info(), shape, dtypes).
print("informacion general")
df.info()
print("")
print("tamaño")
print(df.shape)
print("")
print("tipo de datos")
print(df.dtypes)

informacion general
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

tamaño
(891, 12)

tipo de datos
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [87]:
#2. Muestra las 10 primeras y 10 últimas filas.
print("diez primeras")
print(df.head(10))
print("")
print("diez ultimas")
print(df.tail(10))

diez primeras
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C

diez ultimas
     PassengerId  Survived  Pclass                                      Name  \
881          882         0       3                        Markun, Mr. Johann
882          883         0       3              Dahlberg, Miss. Gerda Ulrika
883          884         0       2             Banfield, Mr. Frederick James
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
881    male  33.0      0      0            349257   7.8958   NaN        S
882  female  22.0      0      0              7552  10.5167   NaN        S
883    male  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884    male  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5            382652  29.1250   NaN        Q
886    male  27.0      0      0            211536  13.0000   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0            111369  30.0000  C148        C
890    male  32.0      0      0            370376   7.7500   NaN        Q

In [88]:
#3. Calcula el porcentaje de pasajeros que sobrevivieron y los que no.
Survived = (df["Survived"]==1).sum()
noSurvived = (df["Survived"]==0).sum()

porcsuperv = (Survived / total) * 100
porcnosuperv = (noSurvived / total) * 100

print("Supervivientes: ",porcsuperv,"%")
print("No supervivientes: ",porcnosuperv,"%")

Supervivientes:  38.38383838383838 %
No supervivientes:  61.61616161616161 %

In [91]:
#4. Elimina las filas donde la edad (Age) sea nula.

#ACLARACIÓN SOLO FUNCIONA LA PRIMERA VEZ, PARA QUE FUNCIONE DE NUEVO LA COMPROBACIÓN TENDRAS QUE CARGAR EL ARCHIVO DE NUEVO
# DESCOMENTAR PARA COMPROBAR DE NUEVO:
# df=pd.read_csv("titanic.csv")

print(df.shape)

print("Después de la eliminación")
df = df.dropna(subset=["Age"])
print(df.shape)

(891, 12)
Después de la eliminación
(714, 12)

In [92]:
#5. Añade una columna booleana menor que indique si el pasajero tiene menos de 18 años.
df["menor"] = df["Age"] < 18

print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
885          886         0       3
886          887         0       2
887          888         1       1
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  menor
0        0         A/5 21171   7.2500   NaN        S  False
1        0          PC 17599  71.2833   C85        C  False
2        0  STON/O2. 3101282   7.9250   NaN        S  False
3        0            113803  53.1000  C123        S  False
4        0            373450   8.0500   NaN        S  False
..     ...               ...      ...   ...      ...    ...
885      5            382652  29.1250   NaN        Q  False
886      0            211536  13.0000   NaN        S  False
887      0            112053  30.0000   B42        S  False
889      0            111369  30.0000  C148        C  False
890      0            370376   7.7500   NaN        Q  False

[714 rows x 13 columns]

In [94]:
#6. Muestra el número total de menores y mayores de edad.
numMenor=(df["menor"]==True).sum()
numMayor=(df["menor"]==False).sum()

print("Menores: ",numMenor)
print("Mayores: ",numMayor)

Menores:  113
Mayores:  601

In [95]:
#7. Guarda el nuevo DataFrame en titanic_limpio.csv.
df.to_csv("titanic_limpio.csv")
df=pd.read_csv("titanic_limpio.csv")
print(df)

     Unnamed: 0  PassengerId  Survived  Pclass  \
0             0            1         0       3
1             1            2         1       1
2             2            3         1       3
3             3            4         1       1
4             4            5         0       3
..          ...          ...       ...     ...
709         885          886         0       3
710         886          887         0       2
711         887          888         1       1
712         889          890         1       1
713         890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
709               Rice, Mrs. William (Margaret Norton)  female  39.0      0
710                              Montvila, Rev. Juozas    male  27.0      0
711                       Graham, Miss. Margaret Edith  female  19.0      0
712                              Behr, Mr. Karl Howell    male  26.0      0
713                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked  menor
0        0         A/5 21171   7.2500   NaN        S  False
1        0          PC 17599  71.2833   C85        C  False
2        0  STON/O2. 3101282   7.9250   NaN        S  False
3        0            113803  53.1000  C123        S  False
4        0            373450   8.0500   NaN        S  False
..     ...               ...      ...   ...      ...    ...
709      5            382652  29.1250   NaN        Q  False
710      0            211536  13.0000   NaN        S  False
711      0            112053  30.0000   B42        S  False
712      0            111369  30.0000  C148        C  False
713      0            370376   7.7500   NaN        Q  False

[714 rows x 14 columns]

### Ejercicio 9 - Análisis de cotizaciones bursátiles

In [112]:
#1. Carga el fichero cotizaciones.xlsx con read_excel().
#Asegúrate de indicar correctamente el nombre de la hoja
#(sheet_name) y la fila de cabecera (header).
print("comprobamos el nombre de la hoja")
df = pd.ExcelFile("cotizaciones.xlsx")
print(df.sheet_names)

print("")
print("Hacemos la lectura de el excel")
df = pd.read_excel("cotizaciones.xlsx", sheet_name="cotizacion", header=0)
print(df.head())

comprobamos el nombre de la hoja
['cotizacion']

Hacemos la lectura de el excel
     Nombre    Final   Máximo   Mínimo    Volumen  Efectivo
0   ACCIONA    95.95    96.75    94.40   84962.00   8166.11
1  ACERINOX  8668.00  8672.00  8468.00     885.99   7633.81
2       ACS    37.28    37.66    37.22  655982.00  24517.29
3      AENA   167.10   167.50   166.10  133738.00  22336.10
4   AMADEUS    69.96    70.64    69.56  640476.00  44795.47

In [114]:
#2. Muestra la información general del DataFrame (info()), el tamaño (shape) y las cinco primeras filas (head()).
print("Información general")
print(df.info())
print("")
print("Tamaño")
print(df.shape)

print("")
print("Cinco primeras filas")
print(df.head())

Información general
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    35 non-null     object
 1   Final     35 non-null     float64
 2   Máximo    35 non-null     float64
 3   Mínimo    35 non-null     float64
 4   Volumen   35 non-null     float64
 5   Efectivo  35 non-null     float64
dtypes: float64(5), object(1)
memory usage: 1.8+ KB
None

Tamaño
(35, 6)

Cinco primeras filas
     Nombre    Final   Máximo   Mínimo    Volumen  Efectivo
0   ACCIONA    95.95    96.75    94.40   84962.00   8166.11
1  ACERINOX  8668.00  8672.00  8468.00     885.99   7633.81
2       ACS    37.28    37.66    37.22  655982.00  24517.29
3      AENA   167.10   167.50   166.10  133738.00  22336.10
4   AMADEUS    69.96    70.64    69.56  640476.00  44795.47

In [118]:
#3. Comprueba si existen valores nulos en alguna columna y elimínalos en caso necesario utilizando dropna().
print("Comprobamos si hay valores nulos")
print(df.isnull().sum())
print("")
print("Eliminamos valores nulos con dropna()")
df = df.dropna()

Comprobamos si hay valores nulos
Nombre      0
Final       0
Máximo      0
Mínimo      0
Volumen     0
Efectivo    0
dtype: int64

Eliminamos valores nulos con dropna()

In [119]:
#4. Calcula y muestra los siguientes valores estadísticos: 
#    o El precio medio de la columna Final (mean()). 
#    o El valor máximo y mínimo de la columna Volumen (max() y min()).
medio=df["Final"].mean()
maximo=df["Volumen"].max()
minimo=df["Volumen"].min()

print("")
print("valor medio",medio)
print("valor maximo",maximo)
print("valor minimo",minimo)

valor medio 2796.7687571428573
valor maximo 36129692.0
valor minimo 67.71

In [128]:
#5. Crea una nueva columna llamada Variación, calculada como la diferencia entre el valor Máximo y el valor Mínimo: 
#    Variación = Máximo - Mínimo
df["Variación"]=df["Máximo"]-df["Mínimo"]
print(df[["Máximo", "Mínimo", "Variación"]].head())

    Máximo   Mínimo  Variación
0    96.75    94.40       2.35
1  8672.00  8468.00     204.00
2    37.66    37.22       0.44
3   167.50   166.10       1.40
4    70.64    69.56       1.08

In [129]:
#6. Añade una segunda columna llamada Rentabilidad, definida como el porcentaje de variación entre el valor Final y el Mínimo: 
#    Rentabilidad = ((Final - Mínimo) / Mínimo) * 100
df["Rentabilidad"] = ((df["Final"] - df["Mínimo"]) / df["Mínimo"]) * 100
print(df[["Final", "Mínimo", "Rentabilidad"]].head())

     Final   Mínimo  Rentabilidad
0    95.95    94.40      1.641949
1  8668.00  8468.00      2.361833
2    37.28    37.22      0.161204
3   167.10   166.10      0.602047
4    69.96    69.56      0.575043

In [135]:
#7. Muestra únicamente las filas donde la Rentabilidad supere el 5 %.
rentabilidad5 = df[df["Rentabilidad"] > 5]
print(rentabilidad5)

         Nombre    Final   Máximo  Mínimo    Volumen  Efectivo  Variación  \
5   ARCELORMIT.  14152.0  14318.0   14.08   702841.0   9989.65   14303.92
24       MAPFRE   2654.0   2654.0    2.62  3045972.0   8063.13    2651.38
30       REPSOL  14515.0  14605.0   14.46  5046648.0  73333.78   14590.54

     Rentabilidad
5   100411.363636
24  101197.709924
30  100280.359613

In [136]:
#8. Ordena el DataFrame por la columna Rentabilidad en orden descendente y muestra las 10 primeras empresas.
ordenar = df.sort_values(by="Rentabilidad", ascending=False)
print(ordenar)

          Nombre       Final      Máximo      Mínimo      Volumen   Efectivo  \
24        MAPFRE   2654.0000   2654.0000      2.6200   3045972.00    8063.13
5    ARCELORMIT.  14152.0000  14318.0000     14.0800    702841.00    9989.65
30        REPSOL  14515.0000  14605.0000     14.4600   5046648.00   73333.78
1       ACERINOX   8668.0000   8672.0000   8468.0000       885.99    7633.81
14        ENAGAS     25.6000     25.6600     25.0700       842.54   21524.77
27        MERLIN     12.0800     12.0800     11.8300    777543.00    9357.77
23  INM.COLONIAL   9915.0000   9915.0000   9745.0000    671753.00    6640.38
0        ACCIONA     95.9500     96.7500     94.4000     84962.00    8166.11
26  MELIA HOTELS      8.1400      8.1900      8.0200       480.21    3914.93
16        ENDESA     22.9500     23.0300     22.6200   1236799.00   28233.46
8         BANKIA   2249.0000   2262.0000   2224.0000   3024454.00    6803.54
10          BBVA   5024.0000      5.0500   4969.0000  26447612.00  132560.15
17     FERROVIAL     21.6100     21.7200     21.3800   2065931.00   44656.05
32  TEC.REUNIDAS     23.0000     23.2000     22.7800       122.10    2807.19
15          ENCE   3882.0000   3974.0000   3846.0000   2099698.00    8219.83
28       NATURGY     26.7000     26.7700     26.5300   2100737.00   55986.54
3           AENA    167.1000    167.5000    166.1000    133738.00   22336.10
4        AMADEUS     69.9600     70.6400     69.5600    640476.00   44795.47
33    TELEFONICA   7204.0000   7256.0000   7185.0000   9913249.00   71564.99
7   BA.SANTANDER      4.0200      4.0675      4.0100  36129692.00  145765.44
21       INDITEX     24.9300     25.1900     24.8700   2600144.00   65012.92
13  CIE AUTOMOT.     23.4400     23.7400     23.4000     99506.00    2343.09
2            ACS     37.2800     37.6600     37.2200    655982.00   24517.29
29        R.E.C.  19705.0000  19875.0000  19675.0000   1246171.00   24585.33
18  GRIFOLS CL.A     23.3000     23.6000     23.2700    719503.00   16787.55
11     CAIXABANK   2763.0000   2806.0000   2762.0000  13031097.00   36239.22
6    BA.SABADELL      1.0165   1033.0000      1.0165  12358512.00   12637.65
34      VISCOFAN     48.4600     49.1200     48.4600        67.71    3295.43
12       CELLNEX     30.1700     30.7000     30.1700    857237.00   25965.29
25      MEDIASET   6446.0000   6592.0000   6446.0000   2647557.00   17277.04
20     IBERDROLA      8.4500      8.4500   8262.0000  15637958.00  131426.05
31  SIEMENS GAME     14.3300     14.3900  14155.0000   1054847.00   15084.56
9      BANKINTER      6.5600   6604.0000   6522.0000   1375976.00    9030.20
22       INDRA A      9.5600   9685.0000   9535.0000       392.06    3755.57
19           IAG      5.3000      5.4600   5292.0000   2155081.00   11561.95

     Variación   Rentabilidad
24   2651.3800  101197.709924
5   14303.9200  100411.363636
30  14590.5400  100280.359613
1     204.0000       2.361833
14      0.5900       2.114081
27      0.2500       2.113271
23    170.0000       1.744484
0       2.3500       1.641949
26      0.1700       1.496259
16      0.4100       1.458886
8      38.0000       1.124101
10  -4963.9500       1.106863
17      0.3400       1.075772
32      0.4200       0.965759
15    128.0000       0.936037
28      0.2400       0.640784
3       1.4000       0.602047
4       1.0800       0.575043
33     71.0000       0.264440
7       0.0575       0.249377
21      0.3200       0.241255
13      0.3400       0.170940
2       0.4400       0.161204
29    200.0000       0.152478
18      0.3300       0.128921
11     44.0000       0.036206
6    1031.9835       0.000000
34      0.6600       0.000000
12      0.5300       0.000000
25    146.0000       0.000000
20  -8253.5500     -99.897725
31 -14140.6100     -99.898764
9      82.0000     -99.899417
22    150.0000     -99.899738
19  -5286.5400     -99.899849

In [139]:
#9. Guarda el nuevo DataFrame con los cálculos realizados en un archivo llamado cotizaciones_modificado.xlsx.
df.to_excel("cotizaciones_modificado.xlsx")
df = pd.read_excel("cotizaciones_modificado.xlsx")
print(df.head())

   Unnamed: 0    Nombre    Final   Máximo   Mínimo    Volumen  Efectivo  \
0           0   ACCIONA    95.95    96.75    94.40   84962.00   8166.11
1           1  ACERINOX  8668.00  8672.00  8468.00     885.99   7633.81
2           2       ACS    37.28    37.66    37.22  655982.00  24517.29
3           3      AENA   167.10   167.50   166.10  133738.00  22336.10
4           4   AMADEUS    69.96    70.64    69.56  640476.00  44795.47

   Variación  Rentabilidad
0       2.35      1.641949
1     204.00      2.361833
2       0.44      0.161204
3       1.40      0.602047
4       1.08      0.575043

In [144]:
#10.  Escribe un breve comentario final en el cuaderno: 
#    “¿Qué empresas muestran mayor estabilidad y cuáles presentan más riesgo según la variación y la rentabilidad?” 
print(ordenar.tail(3))
#Antes al ordenar las empresas por rentabilidad, estas son las empresas que tienen menos rentabilidad por lo cual tienen mas riesgo:

       Nombre  Final   Máximo  Mínimo     Volumen  Efectivo  Variación  \
9   BANKINTER   6.56  6604.00  6522.0  1375976.00   9030.20      82.00
22    INDRA A   9.56  9685.00  9535.0      392.06   3755.57     150.00
19        IAG   5.30     5.46  5292.0  2155081.00  11561.95   -5286.54

    Rentabilidad
9     -99.899417
22    -99.899738
19    -99.899849

### Ejercicio 10 - Análisis musical y comportamiento de usuarios